#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web-Dev/runs/run-gQV8L2cwmFRMJ7Ma

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E2WK19VXEQOQCH]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=3228599042]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E36U11KHAWUB2P]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe-dev.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/279.6379b73f.chunk.js"]: Refreshing state... [id=static/js/279.6379b73f.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/612.1313f78c.chunk.js"]: Refreshing state... [id=static/js/612.1313f78c.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/496.71d68e66.chunk.js"]: Refreshing state... [id=static/js/496.71d68e66.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/777.cf1c154f.chunk.js"]: Refreshing state... [id=static/js/777.cf1c154f.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/777.cf1c154f.chunk.js.map"]: Refreshing state... [id=static/js/777.cf1c154f.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js"]: Refreshing state... [id=static/js/main.e083a45e.js]
module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.e083a45e.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css.map"]: Refreshing state... [id=static/css/main.61b89840.css.map]
module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css"]: Refreshing state... [id=static/css/612.11e8f03c.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/279.6379b73f.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/279.6379b73f.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js"]: Refreshing state... [id=static/js/924.16f99540.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/496.71d68e66.chunk.js.map"]: Refreshing state... [id=static/js/496.71d68e66.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/106.28d48f53.chunk.js"]: Refreshing state... [id=static/js/106.28d48f53.chunk.js]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/279.6379b73f.chunk.js.map"]: Refreshing state... [id=static/js/279.6379b73f.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js.map"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css"]: Refreshing state... [id=static/css/main.61b89840.css]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js.map"]: Refreshing state... [id=static/js/924.16f99540.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/612.1313f78c.chunk.js.map"]: Refreshing state... [id=static/js/612.1313f78c.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css.map"]: Refreshing state... [id=static/css/612.11e8f03c.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js.map"]: Refreshing state... [id=static/js/main.e083a45e.js.map]
module.web.aws_s3_object.upload_webapp["static/js/106.28d48f53.chunk.js.map"]: Refreshing state... [id=static/js/106.28d48f53.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_bucket.jowe_web: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "e97e0e0797a3957c2baba57ef1f85792" -> "1db00ea89907a36bba52ee8fb1981a2c"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "B9m.nys1lNeVjWkMIlhBulUdpzVfjXm2" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "d5b09804b2374d2bd427ba58d09996bb" -> "1c64b770ba330794ad478add387bbf24"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "Uho9GsTkhSsTS0rXTxIUV4YQxB_Lfdvw" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/279.6379b73f.chunk.js"] will be destroyed
  # (because key ["static/js/279.6379b73f.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "a221c8fc2d6f49e2e1e29bb469d11659" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/279.6379b73f.chunk.js" -> null
      - key                    = "static/js/279.6379b73f.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/279.6379b73f.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "IhwWkNgmCoT9_e3FuyY1fAg6KTfEd27V" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/279.6379b73f.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/279.6379b73f.chunk.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "686f404fb6748c84bd90802c573b89fc" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/279.6379b73f.chunk.js.LICENSE.txt" -> null
      - key                    = "static/js/279.6379b73f.chunk.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/279.6379b73f.chunk.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "hr5T8Pxy2VmaAfASWkvrJrv3YZHEDAaW" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/279.6379b73f.chunk.js.map"] will be destroyed
  # (because key ["static/js/279.6379b73f.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "680fb45ed16149b602d9ee97a50bbb8a" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/279.6379b73f.chunk.js.map" -> null
      - key                    = "static/js/279.6379b73f.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/279.6379b73f.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "FsWM2W5rE0hl6eLWqdocjxPdVFkiu9kl" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/612.1313f78c.chunk.js"] will be destroyed
  # (because key ["static/js/612.1313f78c.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "6a6dd61e75e73dd8e766214ec0630de8" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/612.1313f78c.chunk.js" -> null
      - key                    = "static/js/612.1313f78c.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/612.1313f78c.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "eugyf2iEcR5YmKGrzBMZ9.JvyMz5AK3d" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/612.1313f78c.chunk.js.map"] will be destroyed
  # (because key ["static/js/612.1313f78c.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "d493ab3c84e03907fd8794a413169432" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/612.1313f78c.chunk.js.map" -> null
      - key                    = "static/js/612.1313f78c.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/612.1313f78c.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "6dxpbPvm2aRr8QC8ntHHwrKNwUEcZ2Cu" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/612.45eadc33.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "a51b0eec09bdeae015d28bdf16db45cc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/612.45eadc33.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/612.45eadc33.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/612.45eadc33.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "eb12c7e0b8650fdd3d0a0335c6a3b805"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/612.45eadc33.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/612.45eadc33.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/62.0f304c96.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "ca404265e27b6809fe2d4bf413015104"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/62.0f304c96.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/62.0f304c96.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/62.0f304c96.chunk.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "686f404fb6748c84bd90802c573b89fc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/62.0f304c96.chunk.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/62.0f304c96.chunk.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/62.0f304c96.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "6689e45f82e0166a6f18a51ad200a9b1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/62.0f304c96.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/62.0f304c96.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js"] will be destroyed
  # (because key ["static/js/924.16f99540.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "6a4a570635a3d501a332e130f08183f7" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/924.16f99540.chunk.js" -> null
      - key                    = "static/js/924.16f99540.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/924.16f99540.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "meKupBR1xuAFwEJPrk7vhyeVJR9vAih0" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js.map"] will be destroyed
  # (because key ["static/js/924.16f99540.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "66537a7ec11fd7d9dbec1cc57872be87" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/924.16f99540.chunk.js.map" -> null
      - key                    = "static/js/924.16f99540.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/924.16f99540.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "6D6uVsE6JPs6EXe9RlhI5Xfhaf9gUfZP" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.883baa43.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "a8b4f0a5972867daeb6d9ff08bdbdad3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/924.883baa43.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/924.883baa43.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.883baa43.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "883bb7ea3e5b92b3ea58102724f9652f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/924.883baa43.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/924.883baa43.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.60cb3f78.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "cb28ac00cc1e791dc0c10e0b794d8af1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.60cb3f78.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.60cb3f78.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.60cb3f78.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "181c2c848ef576805d5d10a752d155f2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.60cb3f78.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.60cb3f78.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.60cb3f78.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "8c66a68c3181cf0f492dbf46d9b3277c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.60cb3f78.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.60cb3f78.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js"] will be destroyed
  # (because key ["static/js/main.e083a45e.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "0b81c955c871b9595a2324af6959d4f2" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.e083a45e.js" -> null
      - key                    = "static/js/main.e083a45e.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.e083a45e.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "U5e77_xFiPUc.7LEAde9j__vf98wpO54" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.e083a45e.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "0ac550b1d44507bce29e441214b0a192" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.e083a45e.js.LICENSE.txt" -> null
      - key                    = "static/js/main.e083a45e.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.e083a45e.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "gfUnoU4RzjNsn8JJuOdYwrwVfV03b0jX" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e083a45e.js.map"] will be destroyed
  # (because key ["static/js/main.e083a45e.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "85f075fa73495732c3f78aa63351de2b" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.e083a45e.js.map" -> null
      - key                    = "static/js/main.e083a45e.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.e083a45e.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "6sN50blfxr30z7ONTTOlNLbkEPLiqGkx" -> null
    }

Plan: 10 to add, 2 to change, 10 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 37 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dependabot[bot], Action: `pull_request`*